#+TITLE:       Literate Emacs Configuration
#+AUTHOR:      Dmitri Brengauz
#+EMAIL:       dmitri at momus dot net
#+DATE:        2016-03-15 Tue
#+DESCRIPTION: Managing my .emacs the literate programming way with org-mode.

******* Dependencies
        [[https://developer.fedoraproject.org/tech/languages/nodejs/nodejs.html][Now]] on Fedora, nmp comes with nodejs
        #+BEGIN_SRC sh :tangle no :dir /sudo:: :results value verbatim
        sudo yum -y install nodejs 
        #+END_SRC

        #+RESULTS:
        : Last metadata expiration check: 2:54:21 ago on Tue 25 Sep 2018 07:30:35 PM MDT.
        : Dependencies resolved.
        : Nothing to do.
        : Complete!

        Which is needed to install the indium server:
        #+BEGIN_SRC sh :tangle no :dir /sudo:: :results value verbatim
        npm install -g indium
        #+END_SRC

        #+RESULTS:
        : /usr/bin/indium -> /usr/lib/node_modules/indium/bin/indium
        : + indium@3.2.0
        : added 10 packages in 2.151s

